app/controllers/microposts_controller.rb

SELECT "users".* FROM "users"
---
  def new
    @micropost = Micropost.new
    @users=User.all

SELECT "users".* FROM "users"
---
  def edit
    @users=User.all

INSERT INTO "microposts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "binh luan dau tien cua 1"], ["created_at", "2014-10-30 07:04:05.225905"], ["updated_at", "2014-10-30 07:04:05.225905"], ["user_id", 1]]
---
  def create
    @micropost = Micropost.new(micropost_params)

    respond_to do |format|
      if @micropost.save